<?php
	//$var = '{"personal":{},"numRead1_index":-1,"numRead1_num":-1,"numRead2_index":-1,"numRead2_num":-1,"picRead1_index":-1,"picRead2_index":-1,"wordRead1_index":-1,"wordRead1_word":"","wwords1":[],"wordRead2_index":-1,"wordRead2_word":"","wwords2":[],"modu_pratice":{},"modu_show":["他今天生日,妈妈给他买了块月饼","香蕉和菠菜都是水果","放暑假了,小丽穿上漂亮的花棉袄去姥姥家玩","金鱼摇摆尾巴在水里游","乐乐的小狗看到陌生人会狂叫","这河水很脏,能看清河底的石块","早晨,太阳从西边的群山间升起","小鸡用四条腿在地上跑","天上的大雁排成了人字形","中国国旗是五星红旗","夜晚,湖面倒映着月亮的影子","乌云密布,妈妈准备把被子拿出去晒晒","丁丁正在用小刀削自动铅笔","牛顿发明了电灯","春节是个合家团圆的日子","大家一边吃着元宵,一边欣赏着天上的月牙","打雷了,不久就响起哗啦啦的雨点声","大家都说新发的校服好看,女生裙子的颜色漂亮","十月一号是国庆节","端午节时,超市开始卖各式各样的粽子","中国和美国是相邻的","课本大多数是纸质的","山羊最喜欢吃新鲜的竹子","夏天田地里很多青蛙在叫"],"modu":{},"langdu_practice":{},"langdu_show":["鸟在飞行时靠耳朵辨别方向","十块钱可以换成两个五块","瀑布从高处落下,飞溅起许多水沫","小兔子喜欢吃胡萝卜","这太阳不错,可以看到了好多颗星星","老虎是食草动物","寒假可以去哈尔滨看冰雕","豹子跑起来速度很快","安徒生喜欢写童话","盲人的听力比较好","这件男孩衣服真好看,尤其是裙子上的花边格外漂亮","小峰说他是二月三十号出生的","一年有时有三百六十六天","有许多动物生活在热带雨林里","老师用红色水笔批改作业","小兔子爬树能力很强","冬日的池塘里开满了荷花","在生日聚会中,他把生日蛋糕分给每位朋友","儿童节是七月一号","快放学时,校门口站着许多接孩子的家长","这只小花猫非常乖巧,总围着我脚边汪汪叫","她性格内向,总喜欢和小朋友一起玩","日常穿的衣服是木头做的","一元钱可以换十二角"],"langdu":{},"eval":{"2-2":["老鼠","豹子"]}}';
	//$var = '{"personal":{"sex":"female","age":"2","phone":"2","wechat":"2","alipay":"2","mail":"23@323","province":"2","city":"2","zone":"2"},"numRead1_index":"18","numRead1_num":"7","numRead2_index":"39","numRead2_num":"4","picRead1_index":"/Public/h5test/imgs/img2.png","picRead2_index":"/Public/h5test/imgs/img5.png","wordRead1_index":"23","wordRead1_word":"想","wwords1":[[33,"美"],[44,"真"],[55,"队"],[66,"万"]],"wordRead2_index":-1,"wordRead2_word":"","wwords2":[[35,"加"],[34,"新"],[45,"走"],[56,"马"],[67,"拉"]],"modu_pratice":{"这只鸵鸟飞的很高":"1","天气晴朗,适合去公园游玩":"0"},"modu_show":["课本大多数是纸质的","香蕉和菠菜都是水果","牛顿发明了电灯","大家都说新发的校服好看,女生裙子的颜色漂亮","放暑假了,小丽穿上漂亮的花棉袄去姥姥家玩","夏天田地里很多青蛙在叫","早晨,太阳从西边的群山间升起","丁丁正在用小刀削自动铅笔","中国和美国是相邻的","金鱼摇摆尾巴在水里游","春节是个合家团圆的日子","山羊最喜欢吃新鲜的竹子","天上的大雁排成了人字形","十月一号是国庆节","乐乐的小狗看到陌生人会狂叫","中国国旗是五星红旗","他今天生日,妈妈给他买了块月饼","乌云密布,妈妈准备把被子拿出去晒晒","打雷了,不久就响起哗啦啦的雨点声","大家一边吃着元宵,一边欣赏着天上的月牙","小鸡用四条腿在地上跑","夜晚,湖面倒映着月亮的影子","端午节时,超市开始卖各式各样的粽子","这河水很脏,能看清河底的石块"],"modu":{"课本大多数是纸质的":[0,1570433389701,1570433390695],"香蕉和菠菜都是水果":[1,1570433391188,1570433391802],"牛顿发明了电灯":[0,1570433392583,1570433393295],"大家都说新发的校服好看,女生裙子的颜色漂亮":[1,1570433393831,1570433394584],"放暑假了,小丽穿上漂亮的花棉袄去姥姥家玩":[0,1570433395235,1570433395742],"夏天田地里很多青蛙在叫":[1,1570433396210,1570433396735],"早晨,太阳从西边的群山间升起":[0,1570433397253,1570433397720],"丁丁正在用小刀削自动铅笔":[1,1570433398204,1570433398663],"中国和美国是相邻的":[0,1570433399182,1570433399894],"金鱼摇摆尾巴在水里游":[1,1570433400380,1570433400887],"春节是个合家团圆的日子":[0,1570433401438,1570433401954],"山羊最喜欢吃新鲜的竹子":[1,1570433402488,1570433403005],"天上的大雁排成了人字形":[0,1570433403563,1570433404047],"十月一号是国庆节":[1,1570433404574,1570433405041],"乐乐的小狗看到陌生人会狂叫":[0,1570433405599,1570433406123],"中国国旗是五星红旗":[1,1570433406609,1570433407124],"他今天生日,妈妈给他买了块月饼":[0,1570433407650,1570433408133],"乌云密布,妈妈准备把被子拿出去晒晒":[1,1570433408611,1570433409071],"打雷了,不久就响起哗啦啦的雨点声":[0,1570433409579,1570433410134],"大家一边吃着元宵,一边欣赏着天上的月牙":[1,1570433410704,1570433411343],"小鸡用四条腿在地上跑":[0,1570433412166,1570433412673],"夜晚,湖面倒映着月亮的影子":[1,1570433413289,1570433413789],"端午节时,超市开始卖各式各样的粽子":[0,1570433414365,1570433414921],"这河水很脏,能看清河底的石块":[1,1570433415439,1570433415939]},"langdu_practice":{"土豆是黄色的":"0","叔叔在南极拍了很多绿色植物的照片":"1"},"langdu_show":["一元钱可以换十二角","老师用红色水笔批改作业","儿童节是七月一号","日常穿的衣服是木头做的","豹子跑起来速度很快","鸟在飞行时靠耳朵辨别方向","这只小花猫非常乖巧,总围着我脚边汪汪叫","小兔子喜欢吃胡萝卜","这太阳不错,可以看到了好多颗星星","小峰说他是二月三十号出生的","有许多动物生活在热带雨林里","寒假可以去哈尔滨看冰雕","这件男孩衣服真好看,尤其是裙子上的花边格外漂亮","一年有时有三百六十六天","冬日的池塘里开满了荷花","她性格内向,总喜欢和小朋友一起玩","十块钱可以换成两个五块","小兔子爬树能力很强","瀑布从高处落下,飞溅起许多水沫","安徒生喜欢写童话","在生日聚会中,他把生日蛋糕分给每位朋友","盲人的听力比较好","老虎是食草动物","快放学时,校门口站着许多接孩子的家长"],"langdu":{"一元钱可以换十二角":["0",null,null],"老师用红色水笔批改作业":["0",null,null],"儿童节是七月一号":["0",null,null],"日常穿的衣服是木头做的":["0",null,null],"豹子跑起来速度很快":["0",null,null],"鸟在飞行时靠耳朵辨别方向":["1",null,null],"这只小花猫非常乖巧,总围着我脚边汪汪叫":["1",null,null],"小兔子喜欢吃胡萝卜":["1",null,null],"这太阳不错,可以看到了好多颗星星":["1",null,null],"小峰说他是二月三十号出生的":["1",null,null],"有许多动物生活在热带雨林里":["1",null,null],"寒假可以去哈尔滨看冰雕":["0",null,null],"这件男孩衣服真好看,尤其是裙子上的花边格外漂亮":["1",null,null],"一年有时有三百六十六天":["0",null,null],"冬日的池塘里开满了荷花":["1",null,null],"她性格内向,总喜欢和小朋友一起玩":["0",null,null],"十块钱可以换成两个五块":["1",null,null],"小兔子爬树能力很强":["0",null,null],"瀑布从高处落下,飞溅起许多水沫":["1",null,null],"安徒生喜欢写童话":["0",null,null],"在生日聚会中,他把生日蛋糕分给每位朋友":["1",null,null],"盲人的听力比较好":["0",null,null],"老虎是食草动物":["1",null,null],"快放学时,校门口站着许多接孩子的家长":["0",null,null]},"eval":{"1-1":["七","四"],"1-2":["葡萄","粽子"],"2-1":[],"2-2":["花猫","豹子"]}}';
    $var = '{"personal":{},"numRead1_index":-1,"numRead1_num":-1,"numRead2_index":-1,"numRead2_num":-1,"picRead1_index":-1,"picRead1_img_index":-1,"picRead2_index":-1,"picRead2_img_index":-1,"wordRead1_index":-1,"wordRead1_word":"","wwords1":[],"wordRead2_index":-1,"wordRead2_word":"","wwords2":[],"modu_pratice":{},"modu_show":["十月一号是国庆节","牛顿发明了电灯","打雷了,不久就响起哗啦啦的雨点声","放暑假了,小丽穿上漂亮的花棉袄去姥姥家玩","夏天田地里很多青蛙在叫","天上的大雁排成了人字形","夜晚,湖面倒映着月亮的影子","这河水很脏,能看清河底的石块","大家都说新发的校服好看,女生裙子的颜色漂亮","中国国旗是五星红旗","丁丁正在用小刀削自动铅笔","端午节时,超市开始卖各式各样的粽子","金鱼摇摆尾巴在水里游","香蕉和菠菜都是水果","小鸡用四条腿在地上跑","早晨,太阳从西边的群山间升起","春节是个合家团圆的日子","山羊最喜欢吃新鲜的竹子","中国和美国是相邻的","课本大多数是纸质的","乐乐的小狗看到陌生人会狂叫","乌云密布,妈妈准备把被子拿出去晒晒","他今天生日,妈妈给他买了块月饼","大家一边吃着元宵,一边欣赏着天上的月牙"],"modu":{},"langdu_practice":{},"langdu_show":["寒假可以去哈尔滨看冰雕","儿童节是七月一号","冬日的池塘里开满了荷花","盲人的听力比较好","十块钱可以换成两个五块","她性格内向,总喜欢和小朋友一起玩","日常穿的衣服是木头做的","小兔子喜欢吃胡萝卜","鸟在飞行时靠耳朵辨别方向","老师用红色水笔批改作业","在生日聚会中,他把生日蛋糕分给每位朋友","这只小花猫非常乖巧,总围着我脚边汪汪叫","安徒生喜欢写童话","瀑布从高处落下,飞溅起许多水沫","豹子跑起来速度很快","快放学时,校门口站着许多接孩子的家长","这件男孩衣服真好看,尤其是裙子上的花边格外漂亮","这太阳不错,可以看到了好多颗星星","有许多动物生活在热带雨林里","小峰说他是二月三十号出生的","一元钱可以换十二角","小兔子爬树能力很强","老虎是食草动物","一年有时有三百六十六天"],"langdu":{},"eval":{"2-1":["九月","七月"],"2-2":["花猫","豹子"]}}';

	$result_obj = json_decode($var, true);
	$personal = $result_obj['personal'];
	var_dump($personal);
	
	$data['sex'] =   $personal["sex"];
    $data['age'] = $personal["age"];
    $data['phone'] = $personal["phone"];
    $data['wechat'] =  $personal["wechat"];
    $data['alipay'] =  $personal["alipay"];
    $data['mail'] =  $personal["mail"];
    $data['province'] =   $personal["province"];
    $data['city'] =  $personal["city"];
    $data['zone'] =  $personal["zone"];
    $data['numRead1_index']  =  $result_obj['numRead1_index'];
    $data['numRead1_num'] =    $result_obj['numRead1_num'];
    $data['numRead2_index'] =   $result_obj['numRead2_index'];
    $data['numRead2_num']  =  $result_obj['numRead2_num'];
     $data['picRead1_index']  = $result_obj['picRead1_index'];
     $data['picRead1_img_index']   =$result_obj['picRead1_img_index'];
    $data['picRead2_index'] =   $result_obj['picRead2_index'];
    $data['picRead2_img_index']  =  $result_obj['picRead2_img_index'];
     $data['picRead2_index']  = $result_obj['wordRead1_index'];
     $data['wordRead1_word'] =  $result_obj['wordRead1_word'];
      $data['wwords1'] = json_encode($result_obj['wwords1']);
     $data['wordRead2_index'] =  $result_obj['wordRead2_index'];
     $data['wordRead2_word'] =  $result_obj['wordRead2_word'];
      $data['wwords2'] =  json_encode($result_obj['wwords2']);
      $data['modu_pratice'] =  json_encode($result_obj['modu_pratice']);
      $data['modu_show'] =  json_encode($result_obj['modu_show']);
      $data['modu'] =  json_encode($result_obj['modu']);
     $data['langdu_practice'] =   json_encode($result_obj['langdu_practice']);
     $data['langdu_show'] =   json_encode($result_obj['langdu_show']);
     $data['langdu'] =   json_encode($result_obj['langdu']);
     $data['eval'] =   json_encode($result_obj['eval']);

     print_r($data);
?>
